## Data Analysis functions

In [2]:
import pandas as pd

In [23]:
Data={
'Employee':['Alice','Bob','Jhon','Rock'],
'Place':['USA','INDIA','PAK','JAP'],
'Salary':[200000,300000,234002,110002]
}

df=pd.DataFrame(Data)
df

  Employee  Place  Salary
0    Alice    USA  200000
1      Bob  INDIA  300000
2     Jhon    PAK  234002
3     Rock    JAP  110002

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Employee  4 non-null      object
 1   Place     4 non-null      object
 2   Salary    4 non-null      object
dtypes: object(3)
memory usage: 228.0+ bytes

In [7]:
df.columns

Index(['Employee', 'Place', 'Salary'], dtype='object')

In [8]:
df.keys()

Index(['Employee', 'Place', 'Salary'], dtype='object')

In [9]:
df.head(2)

  Employee  Place Salary
0    Alice    USA   200K
1      Bob  INDIA   230K

In [10]:
df.tail(2)

  Employee Place Salary
2     Jhon   PAK   150K
3     Rock   JAP   190K

In [12]:
df.values

array([['Alice', 'USA', '200K'],
       ['Bob', 'INDIA', '230K'],
       ['Jhon', 'PAK', '150K'],
       ['Rock', 'JAP', '190K']], dtype=object)

In [13]:
df.size

12

In [18]:
row,col=df.shape
row,col

(4, 3)

In [20]:
df['Employee'].unique()

array(['Alice', 'Bob', 'Jhon', 'Rock'], dtype=object)

In [21]:
df['Employee'].nunique()

4

## Applying a funciton on a row

In [27]:
def calculate_bonus(Salary):
    return Salary*0.10

## df['Bonus']=df['Salary'].apply(calculate_bonus)
df['Bonus']=df['Salary'].apply(lambda x:x*0.10)
df

  Employee  Place  Salary    Bonus
0    Alice    USA  200000  20000.0
1      Bob  INDIA  300000  30000.0
2     Jhon    PAK  234002  23400.2
3     Rock    JAP  110002  11000.2

In [28]:
df.applymap(lambda x: x.upper() if type(x)==str else x)

C:\Users\ADMIN\AppData\Local\Temp\ipykernel_17052\402341152.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(lambda x: x.upper() if type(x)==str else x)

  Employee  Place  Salary    Bonus
0    ALICE    USA  200000  20000.0
1      BOB  INDIA  300000  30000.0
2     JHON    PAK  234002  23400.2
3     ROCK    JAP  110002  11000.2

##In the applymap method the changes applied are not permanent and return to oringinal value in the next cell, so inorder to make the changes permanent we need to store it in new dataframe

## Sorting data frames

In [30]:
df_sorted=df.sort_values(['Salary','Bonus'])
df_sorted

  Employee  Place  Salary    Bonus
3     Rock    JAP  110002  11000.2
0    Alice    USA  200000  20000.0
2     Jhon    PAK  234002  23400.2
1      Bob  INDIA  300000  30000.0

After sorting the dataframe the index remain  attached to the original rows.

## Resetting the index without creating a new dataframe

In [ ]:
df